import 'package:flutter/material.dart';

void main() => runApp(UseTerms());

class UseTerms extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      home: Scaffold(
        appBar: AppBar(
          title: Text(
            "이용약관 안내",
            style: TextStyle(
              fontWeight: FontWeight.bold,
              color: Colors.black,
            ),
          ),
          backgroundColor: Colors.white,
          iconTheme: IconThemeData(color: Colors.black),
          elevation: 0,
          leading: IconButton(
            icon: Icon(Icons.arrow_back),
            onPressed: () {
              // 여기에 뒤로 가기 동작 추가
              Navigator.pop(context);
            },
          ),
        ),
        body: SingleChildScrollView(
          padding: EdgeInsets.all(20.0),
          child: Container(
            padding: EdgeInsets.all(15),
            decoration: BoxDecoration(
              color: Colors.grey[200],
                borderRadius: BorderRadius.all(Radius.circular(10.0))
            ),
            child: Text(
              '''
 제1조 (목적)

이 약관은 주식회사 아트맵 주식회사(이하 “회사”라 함)가 운영하는 컴퓨터 등 정보통신설비를 이용하여 용역 등을 거래할 수 있도록 설정하여 제공하는 가상의 영업장(이하 “사이트”라 함)을 통하여 제공하는 인터넷 전자상거래 관련 서비스(이하 “서비스”라 함)와 관련하여 회사와 회원의 권리, 의무, 책임사항을 규정함을 목적으로 합니다. 또한 본 약관은 유무선 PC통신, 스마트폰(아이폰, 안드로이드폰 등) 어플리케이션 및 모바일 웹 등을 이용하는 전자상거래 등에 대해서도 그 성질에 반하지 않는 한 준용됩니다.
제2조 (용어의 정의)

이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
1. 회사가 운영하는 사이트(향후 추가되거나 변경될 수 있음): 
art-map.co.kr 외 회사에서 공지하고 서비스를 제공하는 매체로서 기타 웹사이트 및 모바일 어플리케이션 및 모바일 웹 등을 포함합니다.
2. 서비스: 회사가 운영하는 사이트를 통하여 회원(이하에서 정의됨) 상호간에 광고프로모션 ,유관 상품 등(이하에서 정의됨)의 거래가 이루어질 수 있도록 온라인으로 제공하는 중개 서비스 및 관련 부가서비스 일체와, 광고프로모션,홍보상품(이하에서 정의됨)의 결제가 안전하고 편리하게 이루어질 수 있는 결제 대금 보호서비스를 말합니다. 
3. 회원: 회사에 개인정보를 제공하여 회원 등록을 한 자로서, 회사의 정보를 지속적으로 제공받으며, 이 약관에 따라 회사와 서비스 이용계약을 체결한 자를 말하며, 이하에서 정의되는 이용자와 호스트를 통칭합니다.
4. Product 등: 회원과 회사 간에 거래되는 상품 또는 용역(도슨트가이드,제작상품, 평론 대행, 번역대행, 행사홍보) 또는 회사가 제공하는 상품 등을 총칭합니다.
5. 갤러리,미술관 회원: 영리의 목적 여부를 불문하고 웹, 앱 , 회사의 눈 에서 전시회 홍보를 하는 주체 회원을 의미합니다.
6. 작가 회원: 사이트에서 Product, 광고 상품등을 이용하거나 이용하고자 하는 회원을 의미합니다.
7.일반 회원: 이용자가 유상으로 결제하거나, 회사로부터 적립 받아 사이트에서 상품 구매, 정기적 추천 서비스를 이용 할 수 있는 회원입니다.
이 약관에서 정의되지 않은 용어는 관련법령이 정하는 바에 따르며, 그 외에는 일반적인 상거래 관행에 의합니다.
제3조 (약관의 명시, 효력과 개정)

1. 회사는 이 약관의 내용을 회사의 상호, 영업소 소재지, 대표자의 성명, 사업자등록번호, 연락처 등과 함께 회원이 확인할 수 있도록 사이트 초기 서비스 화면(전면)에 게시합니다. 다만, 이 약관의 구체적 내용은 연결화면을 통하여 볼 수 있습니다.
2. 회사는 약관의 규제에 관한 법률, 전자문서 및 전자거래기본법, 전자서명법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 전자상거래 등에서의 소비자보호에 관한 법률, 전자금융거래법, 위치정보의 보호 및 이용 등에 관한 법률 등 관련법을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다.
3. 회사가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행 약관과 함께 사이트 초기화면에 최소 적용일자 7일 이전부터 적용일자 전일까지 공지합니다. 다만, 회원의 권리, 의무에 중대한 영향을 주는 변경이 이루어질 경우에는 적용일자 30일 이전부터 공지합니다.
4. 제3항에 따라 공지된 적용일자 이후에 회원이 회사의 서비스를 계속 이용하는 경우에는 개정된 약관에 동의하는 것으로 간주합니다. 개정된 약관에 동의하지 아니하는 회원은 언제든지 자유롭게 서비스 이용계약을 해지할 수 있습니다.
5. 이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 관련법령 또는 상관례에 따릅니다.
제4조 (이용계약의 성립)

1. 이용계약은 회원의 약관 동의, 이용신청, 회사의 승낙에 의하여 성립합니다.
2. 이용계약은 관련법령에 의거 만14세 미만의 회원 가입이 제한됩니다.
제5조 (이용신청 및 승낙)

1. 회원은 회사가 정한 가입 양식에 따라 회원정보를 기입한 후 가입 의사를 표시함으로써 이용계약을 신청합니다.
2. 회사는 다음 각 호에 해당하는 이용신청에 대하여는 이를 승낙하지 아니하거나 사후에 이용계약을 해지할 수 있습니다.
(1)이미 가입된 회원과 이메일 주소가 동일한 경우
(2)타인의 명의 내지 개인정보를 도용하거나, 등록 내용에 허위, 기재누락, 오기가 있는 경우
(3)회사에 의하여 이용계약이 해지된 날로부터 3개월 이내에 재이용을 신청하는 경우
(4)이 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우(회원자격 상실 후 3개월이 경과한 자로서 회사의 회원 재이용 승낙을 얻은 경우에는 예외)
(5)부정한 용도 또는 영리를 추구할 목적으로 본 서비스를 이용하고자 하는 경우
(6)이 약관 또는 관련 법령을 위반한 경우
(7)이전에 동일∙유사한 아이디 또는 다른 아이디를 통하여 부정한 사용을 한 이력이 있거나 의심되는 경우
(8)관련법령에 위배되거나 사회의 안녕질서 혹은 미풍양속을 저해할 수 있는 목적으로 신청한 경우
(9)회사의 서비스 운영에 따른 설비에 여유가 없거나, 기술 상 지장이 발생하였거나 발생할 가능성이 있는 경우
(10)만14세 미만의 아동이 법정대리인(부모 등)의 동의를 얻지 아니한 이용신청을 하는 경우
(11)회원이 회사나 다른 회원, 기타 타인의 권리나 명예, 신용, 기타 정당한 이익을 침해하는 행위를 한 경우
(12)회사가 제공하는 각 약관 내지 관련 법령에 위배되거나 위배될 가능성이 있는 부당한 이용신청임이 확인된 경우
(13)기타 회원과의 계속적 거래관계를 지속하기 어렵다고 합리적으로 판단되는 경우
3. 전항 제5호에 따라 부정한 용도 또는 영리를 추구할 목적으로 본 서비스를 이용하였거나, 제7호에 따라 부정한 사용을 한 이력이 있는 경우 해당 위반사유가 발생한 시점에 제7조 제1항에 따른 해지의 의사표시가 있었던 것으로 보아 계약이 자동종료 됩니다.
제6조 (회원정보의 수정)

회원은 이용신청 시 작성한 이용신청 사항에 변경이 있는 경우, 온라인으로 개인정보를 수정하거나 이메일, 전화, 팩스 등의 방법으로 회사에 그 변경사항을 알려야 합니다. 이를 알리지 않아 발생하는 불이익에 대한 모든 책임은 회원에게 있으며, 회사는 이에 대한 책임을 지지 않습니다.
제7조 (이용계약의 종료)

1. 회원의 해지
(1)회원은 언제든지 회사에게 해지의사를 통지함으로써 이용계약을 해지할 수 있습니다.
(2)이용계약은 회사가 회원의 해지의사를 받아 해지 처리하는 시점에 종료됩니다.
(3)본 항에 따라 해지를 한 회원은 이 약관이 정하는 회원가입절차와 관련조항에 위반되지 않는 경우 회원으로 다시 가입할 수 있습니다.
2. 회사의 해지
(1)회사는 회원에게 제5조 2항에서 정하고 있는 이용계약의 해지사유가 있는 경우 회원과의 이용계약을 해지할 수 있습니다. 
(2)회사는 해당 회원에게 14일 이내의 기간을 정하여 사전에 해지사유에 대한 의견진술의 기회를 부여할 수 있습니다.
제8조 (이용제한 등)

1. 회사는 회원이 다음 각 호의 사유에 해당하는 경우 경고 조치를 통해 시정을 요구하고, 지체 없이 하자가 치유되지 않는 경우 호스트에 대한 위반사항 게시, 일시정지 또는 영구이용정지 등으로 서비스의 이용을 단계적으로 제한할 수 있습니다. 다만, 아래 제3호 내지 제10호의 경우에는 회복할 수 없는 손해를 방지하기 위하여 회원에 대한 별도 경고 없이 즉시 일시정지 조치를 할 수 있으며, 중대한 범죄와 관련된다고 판단되는 경우 민형사상 조치와 함께 회원자격의 영구이용정지 조치를 통해 서비스 이용을 제한할 수 있습니다.
(1)가입 신청 시 허위 내용을 등록한 경우
(2)물품 또는 서비스에 대한 대금 결제, 기타 서비스 이용과 관련하여 회원이 부담하는 결제를 기일에 이행하지 않는 경우
(3)타인의 서비스 이용을 방해하거나 정보를 도용하는 등 전자상거래 질서를 위협하는 경우
(4)회사를 이용하여 법령과 이 약관이 금지하거나 공공질서, 미풍양속에 반하는 행위를 하는 경우
(5)회원이 구매한 물품을 고의로 훼손한 후 교환, 환불 등의 보상을 요구한 사실이 확인되는 경우
(6)회원이 물품 또는 서비스 구매 시 결제 정보를 임의로 조작하여 정상 결제가격보다 못 미치는 금액을 결제한 경우
(7)회원이 제15조의2 제5항, 제6항을 위반 한 경우
(8)회원이 회사 시스템이나 서비스를 경유하지 않고 직접 거래할 목적으로 회원 간에 개인정보, 연락처 등(전화번호, 이메일, 메신저, SNS ID 등을 포함하되 이에 한정되지 아니함)를 교환하거나, 전시관의 이미지 등 소개페이지, 게시판, 후기, 이미지/영상, 리뷰, 문의란 등에 위 개인정보, 연락처 등을 기재하거나 기재하도록 유도하는 경우
(9)이용자가 회사 시스템이나 서비스를 경유하지 않고 작가,전시관 에게 중개 등의 대가를 직접 지급한 경우
(10)회원간의 불쾌한 언어사용, 비정상적인 행위 등을 한 것에 대하여 신고가 접수된 경우
(11)고객센터 문의 및 전화 상담 내용이 욕설, 폭언, 성희롱, 반복 민원을 통한 업무방해 등에 해당하는 경우

2. 회사는 전항에도 불구하고 저작권법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 여신전문금융업법 등 기타 현행법령을 위반한 명의도용 및 결제정보 도용, 불법 통신 및 해킹, 악성프로그램의 배포, 접속권한 초과, 신용카드 부정거래 등의 경우에 즉시 영구이용정지를 할 수 있습니다. 
3. 회원은 본조에 따른 이용제한의 경우 고객센터를 통하여 소명자료를 구비하여 이의를 제기할 수 있습니다. 회사가 회원의 이의제기 및 소명이 충분하다고 판단하는 경우 서비스 이용을 즉시 재개할 수 있습니다.
4. 본조에 따른 영구이용정지 시 제15조의 4 제1항에 의하여 적립된 에너지 및 기타 혜택 등도 모두 소멸되며, 회사는 이에 대해 별도로 보상하지 않습니다.
5. 회사는 1년 이상 서비스를 이용하지 않는 회원의 개인정보를 별도로 분리 보관하여 관리하며, 구체적인 파기 등 절차에 대하여는 개인정보 보호법 등 해당 시점에 유효하게 적용되는 법령의 절차에 따릅니다.
제9조 (회원의 이메일 및 비밀번호에 대한 의무)

1. 회원은 자신의 이메일과 비밀번호에 관한 관리책임이 있으며 이를 소홀히 하여 발생한 모든 민형〮사상의 책임은 회사의 고의 또는 중과실이 없는 한 회원 자신에게 있습니다. 회원은 자신의 이메일 및 비밀번호를 제3자에게 알려주어서는 안되며, 회원이 이메일과 비밀번호를 제3자에게 알려줌으로써 발생한 손해에 대해서 회사는 책임을 지지 않습니다. 이메일과 비밀번호가 회원의 의사에 반하여 유출되거나 기타의 사정으로 제3자가 사용하고 있음을 인지한 경우 즉시 비밀번호를 변경하여야 하고, 회사에 통보한 다음 회사의 안내를 따라야 합니다. 이를 소홀히 하여 발생한 모든 책임은 회원이 집니다.
2. 회원은 자신의 이메일 및 비밀번호를 제3자에게 이용하게 해서는 안됩니다.
3. 회원이 자신의 이메일 및 비밀번호를 도난 당하거나 제3자가 이용하고 있음을 인지한 경우에는 즉시 회사에 통보하고, 회사의 조치가 있는 경우에는 그에 따라야 합니다.
4. 회원이 제3항에 따른 통지를 하지 않거나 회사의 조치에 응하지 아니하여 발생하는 모든 불이익에 대한 책임은 회원에게 있습니다.
제10조 (회원의 의무)

1. 회원은 관계법령, 이 약관의 규정, 이용안내 등 회사가 통지하는 사항을 준수하여야 하며, 기타 타인의 권익을 침해하거나, 회사 업무에 방해되는 행위를 하여서는 안됩니다.
2. 회원은 서비스 이용과 관련하여 다음 각 호의 행위를 하여서는 안됩니다.
(1)이용계약 신청 또는 이용정보 변경 시 허위내용의 등록
(2)회사의 서비스에 게시된 정보 또는 회원이 서비스를 이용하여 얻은 정보를 회사의 사전 승낙 없이 영리 또는 비영리의 목적으로 복제, 출판, 방송 등에 사용하거나 제3자에게 제공하는 행위
(3)회사가 게시한 정보의 허가 받지 않은 변경
(4)회사가 제공하는 서비스 및 사이트를 이용하여 본인 또는 제3자를 홍보하거나, 홍보할 기회를 제공하는 행위
(5)회사가 제공하는 서비스 및 사이트를 이용하여 본인을 홍보하거나 제3자의 홍보를 대행하는 등의 방법으로 금전을 수수하는 행위
(6)서비스를 이용할 권리를 양도하고 이를 대가로 금전을 수수하는 행위
(7)회사가 정한 정보 이외의 정보(컴퓨터 프로그램 등)의 송신 또는 게시
(8)정보통신망법 등 관련 법령에 의하여 그 전송 또는 게시가 금지되는 정보(컴퓨터 프로그램 등)을 전송하거나 게시 및 관련 사이트를 링크하는 행위
(9)회사 및 기타 제3자의 저작권 등 지적 재산권에 대한 침해
(10)회사 및 기타 제3자의 명예를 손상시키거나, 신용을 훼손하는 행위 또는 업무를 방해하는 행위
(11)다른 회원의 아이디 및 비밀번호를 도용하여 서비스를 이용하는 행위
(12)회사에서 물품이나 서비스를 이용하는 대가로 타인의 계좌번호, 신용카드 등의 결제정보를 허락 없이 이용하는 행위
(13)정크메일, 스팸메일, 행운의 편지, 광고메일, 외설 또는 폭력적인 메시지, 동영상, 음성 등이 담긴 메일을 보내는 행위
(14)청소년보호법에서 규정하는 청소년유해매체물을 게시(링크 포함)하는 행위
(15)외설 또는 폭력적인 메시지, 동영상, 음성 기타 공공질서, 미풍양속에 반하는 정보, 문장, 도형, 동영상, 음성 등 사이트에 공개, 게시 또는 다른 회원 또는 제3자에게 유포하는 행위
(16)회사의 직원이나 서비스의 관리자로 가장, 사칭하거나 타인의 명의를 도용하여 글을 게시하거나 메일을 발송하는 행위
(17)컴퓨터 소프트웨어, 하드웨어, 전기통신 장비의 정상적인 가동을 방해, 파괴할 목적으로 고안된 소프트웨어 바이러스, 기타 다른 컴퓨터 코드, 파일, 프로그램을 포함하는 자료를 게시하거나 메일로 발송하는 행위
(18)스토킹, 욕설, 채팅글 도배 등 다른 회원의 서비스 이용을 방해하는 행위
(19)다른 회원의 개인정보를 동의 없이 수집, 저장, 공개, 유포하는 행위
(20)불특정 다수의 회원을 대상으로 하여 광고 또는 선전물을 게시하거나 관련 사이트를 링크하는 행위
(21)특정 재화 또는 서비스를 실제 구매 또는 사용하지 않았음에도 불구하고 마치 구매 또는 사용한 듯한 외관을 보이면서 회사의 사이트나 기타 매체를 통해 통상의 비판범위를 초과하여 관련 재화/서비스의 품질을 폄하하거나 회사를 비난하는 행위
(22)회사의 명예나 신용을 훼손하는 행위
(23)회원의 의무 불이행
(24)현행 법령, 회사가 제공하는 서비스에 대한 약관 기타 서비스 이용에 관한 규정 및 회사 방침(사이트 공지사항 포함)에 위반하는 행위
제11조 (회사의 의무)

1. 회사는 관련법령과 이 약관이 금지하거나 공공질서, 미풍양속에 반하는 행위를 하지 않으며, 이 약관이 정하는 바에 따라 지속적이고 안정적으로 서비스를 제공하기 위하여 최선을 다하여야 합니다.
2. 회사는 회원이 안전하게 서비스를 이용할 수 있도록 회원의 개인정보(신용정보 포함) 보호를 위한 보안 시스템을 갖추어야 하며 개인정보 처리방침을 공시하고 준수합니다.
3. 회사는 관련법령이 정한 의무사항을 준수합니다.
제12조 (회사가 제공하는 서비스에 대한 약관 및 이용조건)

1. 회사는 중개서비스를 통하여 이루어지는 회원간의 판매 및 구매와 관련하여 판매의사 또는 구매의사의 존부 및 진정성, 등록물품의 품질, 완전성, 안전성, 적법성 및 타인의 저작권 권리에 대한 비침해성, 회원이 입력하는 정보 및 그 정보를 통하여 링크된 URL에 게재된 자료의 진실성 등 일체에 대하여 보증하지 아니하며, 이와 관련한 일체의 위험과 책임은 해당 회원이 부담해야 합니다.
2. 회사는 회원이 게재하는 이미지 등의 제반 정보를 통제하거나 제한하지 않습니다. 다만, 회사는 회원이 게재한 정보의 내용이 타인의 명예, 권리를 침해하거나 법규정을 위반한다고 판단하는 경우에는 이를 삭제할 수 있고, 판매취소, 판매중지, 기타 필요한 조치를 취할 수 있으며, 호스트는 자신이 의도한 판매효과의 미흡 등을 이유로 회사에 어떠한 책임도 물을 수 없습니다.
제13조 (서비스 이용시간)

서비스의 이용은 회사의 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴 1일 24시간을 원칙으로 합니다. 다만 정기점검 등의 필요로 회사가 정한 날 또는 시간은 제외됩니다.
제14조 (서비스 제공의 중지)

1. 회사는 다음 각 호에 해당하는 경우 서비스 제공을 중지할 수 있습니다.
(1)서비스용 하드웨어, 소프트웨어 등의 보수, 정기 및 비상 점검의 경우
(2)전기통신사업법에 규정된 기간통신사업자가 전기통신 서비스를 중지했을 경우
(3)기타 불가항력적 사유가 있는 경우
2. 회사는 국가비상사태, 정전, 서비스 설비의 장애 또는 서비스 이용의 폭주 등으로 정상적인 서비스 이용에 지장이 있는 때에는 서비스의 전부 또는 일부를 제한하거나 정지할 수 있습니다.
제15조 (사용 가능한 결제 수단)

회원은 회사가 운영하는 사이트에서 이루어지는 물품 또는 서비스 거래에 대한 대금 지급방법을 다음 각 호의 하나로 할 수 있습니다.
1. 신용카드
2. 실시간 계좌이체
3. 휴대폰 결제
4. 기타 회사가 지정하는 지급 수단
제16조 (구매신청)

1. 회원은 이 약관 및 회사가 정한 규정에 따라 아래와 같이 물품 또는 서비스에 대한 구매를 신청합니다.
(1)회원정보(성명, 연락처) 입력
(2)물품 또는 서비스 선택사항 입력
(3)호스트로부터 배송받는 물품의 경우 배송지 정보(성명, 연락처, 주소) 입력
(4)결제방법 선택
(5)결제방법에 따른 결제 정보 입력
(6)개인정보 제3자 제공 및 이용 조건에 동의한다는 표시
2. 결제와 관련하여 회원이 입력한 정보 및 그 정보와 관련하여 발생한 책임과 불이익은 전적으로 회원이 부담하여야 합니다.
제17조 (정보의 제공)

회사는 서비스 이용에 관한 다양한 정보를 이메일, 우편, SMS, 앱푸쉬 등의 방법으로 회원에게 제공할 수 있으며 회원은 수신을 거부할 수 있습니다. 단, 회사는 서비스 이용에 필수적으로 요구되는 정보(관련 규정 및 정책의 변경 등)에 대해서는 회원의 수신거부의사와 무관하게 이를 제공할 수 있습니다.
제18조 (배송)

서비스를 이용하여 체결된 거래 중 호스트가 이용자에게 물품 등을 배송하여야 하는 경우, 모든 배송은 회사가 지정한 택배 서비스에 의하고, 상품에 따라 배송비가 부과될 수 있으며, 회원이 배송비를 부과해야 할 경우 제품 상세 페이지에 미리 고지합니다. 배송 절차는 “주문완료” 후 즉시 진행되며 세부 내용은 다음과 같습니다.
1. 회원에게 대한민국 내의 주소지로의 배송만 제공합니다.
2. 회사는 회원에게  기본적으로 택배 서비스를 이용하며, 일반적으로 주문일로부터 2~3일일 소요, 산간도서지역일 경우 2~3일 추가적으로 소요되며, 제품과 해외물류센터, 기상, 항공운항 등의 사정에 따라 변동될 수 있습니다.
3. 대한민국의 공휴일 및 기타 휴무일에는 배송과정이 진행되지 않습니다. 배송 소요기간은 공휴일을 포함하지 않습니다.
4. 폭설폭우나 천재지변 등 불가항력적인 사유 발생 시 그 기간은 배송 소요기간에서 제외됩니다.
5. 회사의 제품이 재료 부족,품절 등의 사유로 회원이 구매 신청한 물품을 제공할 수 없을 때에는, 회원으로부터 대금을 받은 날로부터 3 영업일 이내에 환불에 필요한 즉시조치를 취하고, 그 사유를 회원에게 통지합니다.
6. 이용자가 기재한 배송지로의 물품 배송이 불가능할 경우에는 호스트는 이용자에게 통지하고 배송 방법을 변경하거나 추가비용을 부과할 수 있습니다.
제19조 (반품/환불/취소)

1. 이용자가 반품, 환불, 취소 요청을 하는 경우 관련 법령 및 회사에서 제공하는 분쟁해결 기준에 부합하는 한 회원은 이를 승인하여야 합니다. 적법한 환불 등 요청에도 불구하고 호스트가 이용자의 요청시로부터 24시간 내에 그 요청을 승인하지 않는 경우 해당 거래는 자동적으로 취소되고 구매대금은 이용자에게 환불됩니다. 신용카드결제 및 휴대폰결제는 신용카드사 및 이동통신사의 환불기준에 의거하여 시일이 소요될 수 있습니다. 단, 이용자는 호스트의 반품, 환불, 취소의 요청에 대한 승인이 있기 전까지 그 의사를 철회할 수 있습니다. 
2. 회사가 운영하는 사이트에서 회원이 구매 가능한 상품은 물품과 일정이 있거나, 일정이 정하여 지지 않은 가이드 상품, 도슨트, 큐레이션 콘텐츠 상품으로 나누어지며, 이 중 회사가 고지하는 물품에 대한 분쟁해결 기준은 다음과 같습니다.
(1) 물품에 대한 주문 취소는 회원님이 PG사 결제 후 배송시작이 되지 않은 상태에서만 가능하며, 이 경우 고객센터 및 사이트를 통해 취소 신청할 수 있습니다. 신청된 취소의 경우 신청 후 근무일수 기준 +1일 이내에 회사가 취소합니다. 배송시작 이후에는 주문 취소는 불가능 합니다.
(2) 회사가 운영하는 사이트에서 판매하는 물품은 물품 특성에 따라 단순 고객 변심으로 인한 반품이 불가능할 수 있습니다.
(3) 호스트가 품절 등의 사유로 회원이 구매 신청한 물품을 제공할 수 없을 때에는, 회원으로부터 대금을 받은 날로부터 3 영업일 이내에 환불에 필요한 조치를 취하고, 그 사유를 회원에게 통지합니다.
(4) 회사는 이미 배송된 물품일지라도 다음과 같은 경우에는 환불 조치합니다.
배송된 물품 등이 주문내용과 상이할 경우
배송된 물품 등이 파손, 손상되었거나 오염되었을 경우(단, 회원의 책임 있는 사유로 상품 등이 훼손된 경우는 제외)
(5) 고객은 반품 의사를 “물품 수령 후 7 영업일 이내” (전자상거래 등에서의 소비자보호에 관한 법률 제17조 제1항)에 회사에게 밝혀야 하고, 반품 신청일 기준으로 7 영업일 이내 상품이 도착해야 합니다.
반품 신청은 이메일(info@art-map.co.kr)이나 회사의 고객센터 챗봇을 통해서가능하며, 회사의 정식 절차에 따라 반품 신청을 하지 않을 경우 원활한 처리가 이루어지지 않을 수 있습니다.
모든 환불은 태그,스티커를 제거 하지 않은 배송 초기 수령된 상태와 동일한 미부착의 상품만 가능합니다.
(6) 환불은 반품하는 상품과 고객센터 이메일(info@art-map.co.kr)을 통해 반품 내용 확인 후 처리해 드립니다. 단, 다음의 경우에는 결제 대금을 환불 처리할 수 없습니다.
이용자에게 책임 있는 사유로 물품 등이 분실 또는 훼손된 경우
수령일로부터 7 영업일 이내 반품 의사가 전달되지 않은 경우
이용자의 부착 사용에 의하여 물품 등의 가치가 감소한 경우
시간의 경과에 의하여 재판매가 곤란할 정도로 물품 등의 가치가 감소한 경우
바코드와 태그, 가격표 등이 초기 수령된 상태와 상이한 경우

(7) 카드 결제에 대한 환불인 경우, 회사가 결제대행사에 요청하는 카드의 결제 취소는 즉시 접수되나, 카드사 사정에 따라 7~10영업일 정도의 취소기간이 소요될 수 있습니다. 카드대금 결제일에 따라 청구작업기간이 다를 수 있으며, 자세한 내용은 해당 카드사에서 확인해야 합니다. (단, 주말, 공휴일은 제외).
(8) 환불/교환 사유에 따른 반품 배송비용 부담 구분은 다음과 같습니다.
제품의 하자에 의한 환불: 회사 부담
잘못된 배송에 의한 환불: 회사 부담
*옵션,재질,캡션 텍스트 오류을 포함한 고객변심에 의한 환불/교환: 회원 부담
3. 상품에 대한 환불/취소 규정은 다음과 같습니다.
이용자가 회사의상품에 대한 환불 의사를 표시하는 경우, 결제대금 보호서비스에 따라 이용자가 결제한 금액을 회사가 환불해줍니다. 다만 프라이빗 도슨트, 번역,평론 대행 등과 같은 상품의 거래가 성사된 후 환불 요청이 들어오는 경우, 회사가 미리 정한 서비스 이용료에 따라 해당 금액은 공제될 수 있습니다. 
4. 회사가 운영하는 사이트에서 이루어지는 거래 중, 물품 외의 아트맵의 무형의 콘텐츠 프로모션 상품에 대해 회사가 제시하는 분쟁해결 기준은 각 거래 계약서에환불규정에 표기되어 배포 될 것이며,환불규정에 따라 변경될 수 있습니다. 회사는 통신판매중개자로 원칙적으로 회원 간 거래에 대하여 환불 의무가 없으며, 당사자간 원활한 분쟁 해결을 위하여 기준을 제시할 뿐이므로 회사는 이에 대한 책임을 보증하지 않습니다. 
제20조 (저작권 등의 귀속 및 이용제한)

1. 회사가 작성한 저작물에 대한 저작권, 특허권, 상표권, 기타 지식 재산권은 회사에 귀속됩니다.
2. 회원은 서비스를 이용함으로써 얻은 정보를 회사의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송 등 기타 방법에 의하여 이용하거나 제3자에게 이용하게 하여서는 안됩니다.
3. 작가,갤러리,미술관 회원이 촬영한 사진, 영상, 글 등(이하 ‘콘텐츠’라 합니다)에 대한 저작권은 원칙적으로 회원에게 귀속됩니다. 회원은 콘텐츠를 아트맵에에 제공할 수 있으며 콘텐츠 제공 시점부터 다음과 같은 내용의 이용권한을 부여합니다.
1) 이용 목적 : 서비스 홍보, 아트맵 회원에게 취향기반 메타 데이터 구축에 이용
2) 이용 권한 : 복제, 배포, 전시, 수정, 공연, 파생저작물 제작이 가능한, 취소불가능한, 비독점적인, 로열티가 없는, 완납된, 전세계적인 라이선스 권한
제21조 (개인정보보호)

1. 회사는 회원의 개인정보를 보호하기 위하여 개인정보 보호법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률 등 관계 법령에서 정하는 바를 준수합니다.
2. 회사는 회원의 개인정보를 보호하기 위하여 개인정보 처리방침을 제정, 서비스 초기화면에 게시합니다. 다만, 개인정보 처리방침의 구체적인 내용은 연결화면을 통하여 볼 수 있습니다.
3. 회사는 이용계약을 위하여 회원이 제공한 정보를 회사의 서비스 운영을 위한 목적 이외의 용도로 사용하거나 회원의 동의 없이 제3자에게 제공하지 않습니다. 단, 다음 각 호의 경우에는 예외로 합니다.
- 법령에 근거하여 회원정보의 이용과 제3자에 대한 정보제공이 허용되는 경우
- 물품 배송업무 등 거래 이행에 필요한 최소한의 회원정보(성명, 주소, 연락처 등)를 배송업체에 알려주는 경우
- 기타 회사의 약관 및 정책에 따라 회원의 동의를 구한 경우
- 회사는 개인정보 처리방침에 따라 회원의 개인정보를 최대한 보호하기 위하여 노력합니다.
제22조 (면책 조항)

1. 회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 회원에게 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면제됩니다.
2. 회사는 회원의 귀책사유로 인한 서비스 이용의 장애에 대하여 책임을 지지 않습니다.
3. 회사는 회원이 서비스를 이용하여 기대하는 수익을 상실한 것에 대하여 책임을 지지 않으며, 그 밖의 서비스를 통하여 얻은 자료로 인한 손해에 관하여 책임을 지지 않습니다.
4. 회사는 회원이 게재한 정보, 자료, 사실의 신뢰도, 정확성 등 내용에 관해서는 책임을 지지 않습니다.
5. 회사는 회원간 또는 회원과 제3자 상호간에 서비스를 매개로 하여 거래 등을 한 경우에는 책임을 지지 않습니다.
6. 회원이 발송한 메일 내용에 대한 법적인 책임은 회원에게 있습니다.
7. 회사가 통신판매중개업자로서 회원들에게 제공하는 서비스는 온라인 거래장소(marketplace)를 제공하거나 안전한 결제 수단을 제공하고 기타 부가정보를 제공함에 그치는 것이므로 중개서비스를 통하여 이루어지는 회원 상호간의 거래와 관련된 서비스 판매진행의 관리, 의뢰인에 대한 거래이행, 서비스발송, 청약철회 또는 반품, 취소요청으로 인한 분쟁해결 등 필요한 사후처리는 거래당사자인 회원들이 직접 수행하여야 합니다. 회사는 회사의 고의 또는 중과실이 없는 한 이에 대하여 관여하지 않으며 어떠한 책임도 부담하지 않습니다. 
8. 단, 회사는 회원 간 또는 회원과 제3자 간 분쟁이 발발했음을 양 당사자 중 한 명 이상으로부터 통보를 받을 경우 전자상거래법에 의거 원만한 분쟁해결 지원을 위해 거래 및 양자의 사이트상 계정에 개입 혹은 기타 분쟁해결에 필요하다고 판단되는 모든 조치(거래금액 동결, 계정정지 등)를 취할 수 있으며, 이 조치는 분쟁이 해결되는 시점까지 지속될 수 있습니다. 단, 회사에서 회원 간 또는 회원과 제3자 간 자체적으로 분쟁 해결이 어렵다고 판단되는 경우 회사는 하기의 외부기관들에 분쟁건을 이관할 수 있으며, 이관된 시점 이후부터는 분쟁조정권고 등 이관된 기관의 의견을 신뢰하며 이를 기준으로 분쟁관련 업무를 처리합니다.

- 대한상사중재원 ( http://www.kcab.or.kr/intro.jsp )
- 한국소비자원 ( http://www.kca.go.kr/ )
- 한국공정거래조정원 ( http://www.kofair.or.kr/goMain.do )
- 정보통신산업진흥원 전자문서·전자거래분쟁조정위원회 ( http://www.ecmc.or.kr )
- 한국콘텐츠진흥원 콘텐츠분쟁조정위원회 (https://www.kcdrc.kr/)
제23조 (분쟁 해결 및 통지)

1. 회사는 이용자가 제기하는 정당한 의견이나 불만을 반영하고 그 피해를 보상처리 하기 위해서 피해보상처리 기구를 설치, 운영합니다.
2. 회사는 이용자로부터 제출되는 불만사항 및 의견을 지체 없이 처리하고자 최선을 다하여야 합니다. 다만 신속한 처리가 곤란한 경우에는 이용자에게 그 사유와 처리 일정을 통보합니다.
3. 회사는 불특정다수 회원에 대한 통지의 경우, 7일 이상 사이트에 게시함으로써 개별 통지에 갈음할 수 있습니다. 다만, 제7조를 포함하여 회원 본인의 거래에 관하여 중대한 영향을 미치는 사항에 대하여는 개별 통지함을 원칙으로 합니다.
제24조 (계약의 해제, 해지 손해배상 등 각종 책임)

1. 회원 또는 회사 중 일방이 본 약관에 명시된 사항을 위반하는 경우 상대방은 상당한 기간을 정하여 상대방에게 위반사항을 시정할 것을 요구할 수 있으며, 시정 요구에도 불구하고 위반사항을 시정하지 아니하면 서면(전자문서, 이메일을 포함하며, 이하 같다)으로 계약을 해지할 수 있습니다.
2. 회사와 회원은 상대방이 주요 자산에 대한 압류 등 강제집행, 거래정지 또는 회생 및 파산신청 등으로 인해 정상적으로 계약 이행을 할 수 없을 경우 계약을 즉시 해지할 수 있습니다.
3. 일방의 귀책사유로 본 계약을 위반하여 발생한 손해에 대하여 상대방은 배상 책임을 부담합니다.
4. 회원이 본 약관 등의 위반 행위와 관련하여 각종 관련 법규(행정, 형사, 공정거래 관련 법률 등)를 위반함이 밝혀진 경우, 본 조에 따른 손해배상 외의 형사절차(고발, 고소 등)를 진행할 수 있으며, 회원은 위반 행위로 인한 제3자의 손해(예: 참가자의 개인정보 유출, 명예훼손 등)에 대해서도 책임을 집니다.
제25조 (준거법 및 관할법원)

1. 이 약관의 해석 및 회사와 회원간의 분쟁에 대하여는 대한민국의 법령을 적용합니다.
2. 서비스 이용 중 발생한 회원과 회사간의 소송은 민사소송법에 의한 관할법원에 제소합니다.
<부칙>

제1조 (시행일자)
2022년 1월27일부터 시행됩니다.

<부칙> (2022년1월 21일 개정)
개정약관은 2022년 1월 27일부터 시행됩니다.
              
               '''
            ),
          ),
        ),
      ),
    );
  }
}
